rammp-org/prototype-fw/STEM_V3/serial_protocol_example/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y

# UART0 is the host control transport through an external USB-UART adapter.
# Keep diagnostics on USB Serial/JTAG so they cannot corrupt the UART0 protocol.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
